vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFM32PG12B_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>EFM32PG12B_DFP</name>
  <description>Silicon Labs EFM32 Pearl Gecko Series Device Support</description>

  <releases>
    <release version="1.1.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EFM32PG12B_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EFM32PG12B_DFP.
    </release>
    <release version="1.0.0" date="2017-06-22">
      Initial Release of EFM32PG12B Device Family Pack.
      Device support files V5.1.3.
      Flash Algorithms V5.2.0.
      SVD files V5.2.1.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32PG12B</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32PG12B Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="40000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/DUI0552A_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <book name="Documents/efm32pg12-rm.pdf"            title="EFM32PG12B Reference Manual"/>
      <book name="Documents/efm32pg12-datasheet.pdf"     title="EFM32PG12B Data Sheet"/>

      <description>
Silicon Labs' Pearl Gecko 32-bit microcontroller family features a powerful 32-bit ARM® Cortex®-M4 and a wide selection of peripherals, including a unique cryptographic hardware engine supporting AES, ECC, and SHA.
These features, combined with ultra-low current active mode and short wake-up time from energy-saving modes, make Pearl Gecko microcontrollers well suited for any battery-powered application, as well as other systems requiring high performance and low-energy consumption.
      </description>

      <!-- ************************  Subfamily 'EFM32PG12B500'  **************************** -->
      <subFamily DsubFamily="EFM32PG12B500">

        <!-- *************************  Device 'EFM32PG12B500F1024GL125'  ***************************** -->
        <device Dname="EFM32PG12B500F1024GL125">
          <compile header="Device/EFM32PG12B/Include/em_device.h"  define="EFM32PG12B500F1024GL125"/>
          <debug svd="SVD/EFM32PG12B/EFM32PG12B500F1024GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG12B500F1024GM48'  ***************************** -->
        <device Dname="EFM32PG12B500F1024GM48">
          <compile header="Device/EFM32PG12B/Include/em_device.h"  define="EFM32PG12B500F1024GM48"/>
          <debug svd="SVD/EFM32PG12B/EFM32PG12B500F1024GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG12B500F1024IL125'  ***************************** -->
        <device Dname="EFM32PG12B500F1024IL125">
          <compile header="Device/EFM32PG12B/Include/em_device.h"  define="EFM32PG12B500F1024IL125"/>
          <debug svd="SVD/EFM32PG12B/EFM32PG12B500F1024IL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG12B500F1024IM48'  ***************************** -->
        <device Dname="EFM32PG12B500F1024IM48">
          <compile header="Device/EFM32PG12B/Include/em_device.h"  define="EFM32PG12B500F1024IM48"/>
          <debug svd="SVD/EFM32PG12B/EFM32PG12B500F1024IM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG12B500F512GL125'  ***************************** -->
        <device Dname="EFM32PG12B500F512GL125">
          <compile header="Device/EFM32PG12B/Include/em_device.h"  define="EFM32PG12B500F512GL125"/>
          <debug svd="SVD/EFM32PG12B/EFM32PG12B500F512GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00080000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG12B500F512GM48'  ***************************** -->
        <device Dname="EFM32PG12B500F512GM48">
          <compile header="Device/EFM32PG12B/Include/em_device.h"  define="EFM32PG12B500F512GM48"/>
          <debug svd="SVD/EFM32PG12B/EFM32PG12B500F512GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00080000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32PG12B">
      <description>Silicon Labs EFM32PG12B devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32PG12B*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32PG12B CMSIS">
      <description>Silicon Labs EFM32PG12B devices, CMSIS Core</description>
      <require condition="EFM32PG12B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32PG12B CMSIS GCC">
      <description>Silicon Labs EFM32PG12B devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32PG12B CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32PG12B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32PG12B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
